abstract class AppConstants {
  static const List <String> surahNames = [
    "الفاتحه","البقرة","آل عمران","النساء","المائدة","الأنعام","الأعراف","الأنفال","التوبة","يونس","هود"
    ,"يوسف","الرعد","إبراهيم","الحجر","النحل","الإسراء","الكهف","مريم","طه","الأنبياء","الحج","المؤمنون"
    ,"النّور","الفرقان","الشعراء","النّمل","القصص","العنكبوت","الرّوم","لقمان","السجدة","الأحزاب","سبأ"
    ,"فاطر","يس","الصافات","ص","الزمر","غافر","فصّلت","الشورى","الزخرف","الدّخان","الجاثية","الأحقاف"
    ,"محمد","الفتح","الحجرات","ق","الذاريات","الطور","النجم","القمر","الرحمن","الواقعة","الحديد","المجادلة"
    ,"الحشر","الممتحنة","الصف","الجمعة","المنافقون","التغابن","الطلاق","التحريم","الملك","القلم","الحاقة","المعارج"
    ,"نوح","الجن","المزّمّل","المدّثر","القيامة","الإنسان","المرسلات","النبأ","النازعات","عبس","التكوير","الإنفطار"
    ,"المطفّفين","الإنشقاق","البروج","الطارق","الأعلى","الغاشية","الفجر","البلد","الشمس","الليل","الضحى","الشرح"
    ,"التين","العلق","القدر","البينة","الزلزلة","العاديات","القارعة","التكاثر","العصر",
    "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون","النصر","المسد","الإخلاص","الفلق","الناس"
  ];

  static const List <int> numberOfAyat = [
    7, 286, 200, 176, 120, 165, 206, 75, 129, 109, 123, 111, 43, 52, 99, 128, 111, 110, 98, 135, 112, 78,
    118, 64, 77, 227, 93, 88, 69, 60, 34, 30, 73, 54, 45, 83, 182, 88, 75, 85, 54, 53, 89, 59, 37, 35, 38,
    29, 18, 45, 60, 49, 62, 55, 78, 96, 29, 22, 24, 13, 14, 11, 11, 18, 12, 12, 30, 52, 52, 44, 28, 28,
    20, 56, 40, 31, 50, 40, 46, 42, 29, 19, 36, 25, 22, 17, 19, 26, 30, 20, 15, 21, 11, 8, 8, 19, 5, 8,
    8, 11, 11, 8, 3, 9, 5, 4, 7, 3, 6, 3, 5, 4, 5, 6];

  // static const List<String> hadithList = [
  //   'الحديث الأول', 'الحديث الثاني', 'الحديث الثالث', 'الحديث الرابع', 'الحديث الخامس', 'الحديث السادس',
  //   'الحديث السابع', 'الحديث الثامن', 'الحديث التاسع', 'الحديث العاشر', 'الحديث الحادي عشر',
  //   'الحديث الثاني عشر', 'الحديث الثالث عشر', 'الحديث الرابع عشر', 'الحديث الخامس عشر',
  //   'الحديث السادس عشر', 'الحديث السابع عشر', 'الحديث الثامن عشر', 'الحديث التاسع عشر',
  //   'الحديث العشرون', 'الحديث الحادي والعشرون', 'الحديث الثاني والعشرون', 'الحديث الثالث والعشرون',
  //   'الحديث الرابع والعشرون', 'الحديث الخامس والعشرون', 'الحديث السادس والعشرون',
  //   'الحديث السابع والعشرون', 'الحديث الثامن والعشرون', 'الحديث التاسع والعشرون',
  //   'الحديث الثلاثون', 'الحديث الحادي والثلاثون', 'الحديث الثاني والثلاثون', 'الحديث الثالث والثلاثون',
  //   'الحديث الرابع والثلاثون', 'الحديث الخامس والثلاثون', 'الحديث السادس والثلاثون',
  //   'الحديث السابع والثلاثون', 'الحديث الثامن والثلاثون', 'الحديث التاسع والثلاثون',
  //   'الحديث الأربعون', 'الحديث الحادي والأربعون', 'الحديث الثاني والأربعون', 'الحديث الثالث والأربعون',
  //   'الحديث الرابع والأربعون', 'الحديث الخامس والأربعون', 'الحديث السادس والأربعون',
  //   'الحديث السابع والأربعون', 'الحديث الثامن والأربعون', 'الحديث التاسع والأربعون', 'الحديث الخمسون',
  // ];

  // static const Map <String, int> surahDetails = {
  //   "الفاتحه" : 7, "البقرة" : 286, "آل عمران" : 200, "النساء" : 176, "المائدة" : 120, "الأنعام": 165,
  //   "الأعراف" : 206, "الأنفال" : 75, "التوبة" : 129, "يونس" : 109, "هود" : 123, "يوسف" : 111, "الرعد" : 43,
  //   "إبراهيم" : 52, "الحجر" : 99, "النحل" : 128, "الإسراء" : 111, "الكهف" : 110, "مريم" : 98, "طه" : 135,
  //   "الأنبياء" : 112, "الحج" : 78, "المؤمنون" : 118 ,"النّور" : 64, "الفرقان" : 77, "الشعراء" : 227,
  //   "النّمل" : 93, "القصص" : 88, "العنكبوت" : 69, "الرّوم" : 60, "لقمان" : 34, "السجدة" : 30,
  //   "الأحزاب" : 73, "سبأ" : 54 ,"فاطر" : 45, "يس" : 83, "الصافات" : 182, "ص" : 88, "الزمر" : 75,
  //   "غافر" : 85, "فصّلت" : 54, "الشورى" : 53, "الزخرف" : 89, "الدّخان" : 59, "الجاثية" : 37, "الأحقاف" : 35
  //   ,"محمد" : 38, "الفتح" : 29, "الحجرات" : 18, "ق" : 45, "الذاريات" : 60, "الطور" : 49, "النجم" : 62,
  //   "القمر" : 55, "الرحمن" : 78, "الواقعة" : 96, "الحديد" : 29, "المجادلة" : 22 ,"الحشر" : 24,
  //   "الممتحنة" : 13, "الصف" : 14, "الجمعة" : 11, "المنافقون" : 11, "التغابن" : 18, "الطلاق" : 12,
  //   "التحريم" : 12, "الملك" : 30, "القلم" : 52, "الحاقة" : 52, "المعارج" : 44 ,"نوح" : 28, "الجن" : 28,
  //   "المزّمّل" : 20, "المدّثر" : 56, "القيامة" : 40, "الإنسان" : 31, "المرسلات" : 50, "النبأ" : 40,
  //   "النازعات" : 46, "عبس" : 42, "التكوير" : 29, "الإنفطار" : 19 ,"المطفّفين" : 36, "الإنشقاق" : 25,
  //   "البروج" : 22, "الطارق" : 17, "الأعلى" : 19, "الغاشية" : 26, "الفجر" : 30, "البلد" : 20, "الشمس" : 15,
  //   "الليل" : 21, "الضحى" : 11, "الشرح" : 8 ,"التين" : 8, "العلق" : 19, "القدر" : 5, "البينة" : 8,
  //   "الزلزلة" : 8, "العاديات" : 11, "القارعة" : 11, "التكاثر" : 8, "العصر" : 3, "الهمزة" : 9, "الفيل" : 5,
  //   "قريش" : 4, "الماعون" : 7, "الكوثر" : 3, "الكافرون" : 6, "النصر" : 3, "المسد" : 5, "الإخلاص" : 4,
  //   "الفلق" : 5, "الناس" : 6
  // };
}